In [1]:
import numpy as np
import pandas as pd

In [12]:
data ={
    'a':[1,2,np.nan,4,5],
    'b':[1,2,3,4,5],
    'c':[1,2,3,np.nan,np.nan],
    'd':[1,np.nan,np.nan,np.nan,5]
    
    
}

df = pd.DataFrame(data)

In [ ]:
df
# nan is null value

     a    b    c    d
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [9]:
df.isna().sum()

a    1
b    1
c    2
d    3
dtype: int64

In [10]:
df.isna().any()

a    True
b    True
c    True
d    True
dtype: bool

In [13]:
df.dropna()

     a  b    c    d
0  1.0  1  1.0  1.0

In [14]:
df

     a  b    c    d
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [16]:
df.fillna(0)

     a  b    c    d
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [17]:
values={'a':0,'b':100,'c':300,'d':500}
df.fillna(value=values)

     a  b      c      d
0  1.0  1    1.0    1.0
1  2.0  2    2.0  500.0
2  0.0  3    3.0  500.0
3  4.0  4  300.0  500.0
4  5.0  5  300.0    5.0

In [18]:
df.fillna(df.mean())

     a  b    c    d
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0